shimjaeyeong/H-TEC/Micrium/Software/EvalBoards/ST/STM3210B-EVAL/IAR/OS-Probe/app_sy.c
/*
 *********************************************************************************************************
 *                                              TERM PROJECT
 *                          (C) Copyright 2020; Lee Seung Yun; Shim Jae Yeong
 *               Some codes are referenced below.
 * 
 *                                              EXAMPLE CODE
 *
 *                          (c) Copyright 2003-2006; Micrium, Inc.; Weston, FL
 *
 *               All rights reserved.  Protected by international copyright laws.
 *               Knowledge of the source code may NOT be used to develop a similar product.
 *               Please help us continue to provide the Embedded community with the finest
 *               software available.  Your honesty is greatly appreciated.
 *********************************************************************************************************
 */

/*
 *********************************************************************************************************
 *
 *                             High Temperature Entrance Checking Technique
 *
 *                                     ST Microelectronics STM32
 *                                              with the
 *                                   STM3210B-EVAL Evaluation Board
 *
 * Filename      : app.c
 * Version       : V1.0
 * Programmer(s) : Lee Seung Yun, Shim Jae Yeong
 *********************************************************************************************************
 */

/*
 *********************************************************************************************************
 *                                             INCLUDE FILES
 *********************************************************************************************************
 */

#include <includes.h>
#include <stm32f10x_gpio.h>
#include <stm32f10x_rcc.h>
#include <stm32f10x_i2c.h>
#include <stm32f10x_adc.h>
#include <stm32f10x_spi.h>
#include <stm32f10x_tim.h>

/*
 *********************************************************************************************************
 *                                            LOCAL DEFINES
 *********************************************************************************************************
 */

/*
 *********************************************************************************************************
 *                                       LOCAL GLOBAL VARIABLES
 *********************************************************************************************************
 */

// Task Stack (size: 128)
static OS_STK App_TaskDetectStk[APP_TASK_STK_SIZE];
static OS_STK App_TaskTemperStk[APP_TASK_STK_SIZE];
static OS_STK App_TaskPassStk[APP_TASK_STK_SIZE];
static OS_STK App_TaskDenyStk[APP_TASK_STK_SIZE];
// Original Task Stack
static OS_STK App_TaskStartStk[APP_TASK_STK_SIZE];
static OS_STK App_TaskUserIFStk[APP_TASK_USER_IF_STK_SIZE];
static OS_STK App_TaskKbdStk[APP_TASK_KBD_STK_SIZE];

//static OS_EVENT      *App_UserIFMbox; // 메시지 박스

// Message Que
static OS_EVENT *App_msgQue;
static void *msg[10];

// Event Flags
static OS_FLAG_GRP *flagGroup;
static OS_FLAGS check;
// TODO("Check OS FLAG")
//#define OS_FLAGS_NBITS 8
//#define OS_FLAG_EN 1

#if ((APP_OS_PROBE_EN == DEF_ENABLED) &&  \
	 (APP_PROBE_COM_EN == DEF_ENABLED) && \
	 (PROBE_COM_STAT_EN == DEF_ENABLED))
static CPU_FP32 App_ProbeComRxPktSpd;
static CPU_FP32 App_ProbeComTxPktSpd;
static CPU_FP32 App_ProbeComTxSymSpd;
static CPU_FP32 App_ProbeComTxSymByteSpd;

static CPU_INT32U App_ProbeComRxPktLast;
static CPU_INT32U App_ProbeComTxPktLast;
static CPU_INT32U App_ProbeComTxSymLast;
static CPU_INT32U App_ProbeComTxSymByteLast;

static CPU_INT32U App_ProbeComCtrLast;
#endif

#if (APP_OS_PROBE_EN == DEF_ENABLED)
static CPU_INT32U App_ProbeCounts;
static CPU_BOOLEAN App_ProbeB1;

#endif

/*
 *********************************************************************************************************
 *                                      LOCAL FUNCTION PROTOTYPES
 *********************************************************************************************************
 */

// Task function
static void App_TaskDetect(void *p);
static void App_TaskTemper(void *p);
static void App_TaskPass(void *p);
static void App_TaskDeny(void *p);

// Original function
static void App_TaskCreate(void);
static void App_EventCreate(void);

static void App_TaskStart(void *p_arg);
static void App_TaskUserIF(void *p_arg);
static void App_TaskKbd(void *p_arg);

static void App_DispScr_SignOn(void);
static void App_DispScr_TaskNames(void);

#if ((APP_PROBE_COM_EN == DEF_ENABLED) || \
	 (APP_OS_PROBE_EN == DEF_ENABLED))
static void App_InitProbe(void);
#endif

#if (APP_OS_PROBE_EN == DEF_ENABLED)
static void App_ProbeCallback(void);
#endif

/*
 *********************************************************************************************************
 *                                                main()
 *
 * Description : This is the standard entry point for C code.  It is assumed that your code will call
 *               main() once you have performed all necessary initialization.
 *
 * Argument(s) : none.
 *
 * Return(s)   : none.
 *********************************************************************************************************
 */

int main(void)
{
	CPU_INT08U os_err;

	/* Disable all ints until we are ready to accept them.  */
	BSP_IntDisAll();

	/* Initialize "uC/OS-II, The Real-Time Kernel".         */
	OSInit();

	// Create Message Que, msg : 저장공간, 크기 : 10
	App_msgQue = OSQCreate(msg, 10);

	// Create Event Flag
	flagGroup = OSFlagCreate(check, os_err);

	os_err = OSTaskCreateExt((void (*)(void *))App_TaskDetect,                      // Task가 수행할 함수, 사람의 존재 유/무를 알려주는 Task
							 (void *)0,												// Task로 넘겨줄 인자
							 (OS_STK *)&App_TaskDetectStk[APP_TASK_STK_SIZE - 1],	// Task가 할당될 Stack의 Top을 가리키는 주소
							 (INT8U)APP_TASK_DETECT_PRIO,							// Task의 우선 순위 (MPT)
							 (INT16U)APP_TASK_DETECT_PRIO,							// Task를 지칭하는 유일한 식별자, Task 갯수의 극복을 위해서 사용할 예정, 현재는 우선 순위와 같게끔 설정
							 (OS_STK *)&App_TaskDetectStk,							// Task가 할당될 Stack의 마지막을 가리키는 주소, Stack 검사용으로 사용
							 (INT32U)APP_TASK_STK_SIZE,								// Task Stack의 크기를 의미
							 (void *)0,												// Task Control Block 활용시 사용
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));	// Task 생성 옵션

	os_err = OSTaskCreateExt((void (*)(void *))App_TaskTemper,                      // 사람의 온도를 측정하여 통과할지 말지를 결정하는 Task
							 (void *)0,
							 (OS_STK *)&App_TaskTemperStk[APP_TASK_STK_SIZE - 1],
							 (INT8U)APP_TASK_TEMPER_PRIO,
							 (INT16U)APP_TASK_TEMPER_PRIO,
							 (OS_STK *)&App_TaskTemperStk,
							 (INT32U)APP_TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

	os_err = OSTaskCreateExt((void (*)(void *))App_TaskPass,                         // 정상체온인 사람은 통과를 허가하는 Task            
							 (void *)0,
							 (OS_STK *)&App_TaskPassStk[APP_TASK_STK_SIZE - 1],
							 (INT8U)APP_TASK_PASS_PRIO,
							 (INT16U)APP_TASK_PASS_PRIO,
							 (OS_STK *)&App_TaskPASSStk,
							 (INT32U)APP_TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

	os_err = OSTaskCreateExt((void (*)(void *))App_TaskDeny,                         // 비정상체온인 사람은 통과를 불허하는 Task
							 (void *)0,
							 (OS_STK *)&App_TaskDenyStk[APP_TASK_STK_SIZE - 1],
							 (INT8U)APP_TASK_DENY_PRIO,
							 (INT16U)APP_TASK_DENY_PRIO,
							 (OS_STK *)&App_TaskDeNYStk,
							 (INT32U)APP_TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

#if (OS_TASK_NAME_SIZE >= 11)
	OSTaskNameSet(APP_TASK_START_PRIO, (CPU_INT08U *)"Start Task", &os_err);
#endif

	OSStart(); /* Start multitasking (i.e. give control to uC/OS-II).  */

	return (0);
}

